mirkomare/MrBin/src/mrbin_core/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# SD card (SDIO 3.0 on Waveshare board)
CONFIG_FATFS_LFN_STACK=y
CONFIG_FATFS_MAX_LFN=255

# Wi-Fi via ESP32-C6 slave (when enabled)
CONFIG_ESP_WIFI_REMOTE_ENABLED=y

# mbedTLS for AES
CONFIG_MBEDTLS_HARDWARE_AES=y
